Revit 2026 API

# TransformMultiply Operator

---

Multiplies the two specified transforms.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Transform operator *(
	Transform left,
	Transform right
)
```
```vb
Public Shared Operator * (
	left As Transform,
	right As Transform
) As Transform
```
```cpp
public:
static Transform^ operator *(
	Transform^ left,
	Transform^ right
)
```
```fsharp
static let inline (*)
        left : Transform *
        right : Transform  : Transform
```

#### Parameters

left Transform
    The first transformation.
right Transform
    The second transformation.

#### Return Value

TransformThe transformation equal to the composition of the two transformations.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the handle of the first or second transformation is . |

The combined transformation has the same effect as applying the right transformation first, and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

#### Reference

Transform Class

Autodesk.Revit.DB Namespace